# Working with DataFrames Part2

## Rename Index

Imports

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [36]:
# Making a DataFrame
df= DataFrame(np.arange(12).reshape((3, 4)),
                 index=['Rome', 'Berlin', 'London'],
                 columns=['A', 'B', 'C', 'D'])

#Show
df

        A  B   C   D
Rome    0  1   2   3
Berlin  4  5   6   7
London  8  9  10  11

#### Just like a Series and DF columns, axis indexes can also use map

Let's use map to lowercase the city initials.

In [37]:
# lower initials
df.index.map(str.lower)

Index(['rome', 'berlin', 'london'], dtype='object')

But the original df didn't change

In [39]:
# show
df

        A  B   C   D
Rome    0  1   2   3
Berlin  4  5   6   7
London  8  9  10  11

If you want to assign che changes to the actual index, you can use index.

In [41]:
# Use index method
df.index = dframe.index.map(str.lower)
#Show
df

        A  B   C   D
rome    0  1   2   3
berlin  4  5   6   7
london  8  9  10  11

Now the index is in lower case

### The rename method

Use rename method if you want to create a transformed version withouy modifying the original!

With the rename method we can work both on index and columns.

In [43]:
# str.title will capitalize the first letter, lowercasing the columns

df.rename(index=str.title, columns=str.lower)

        a  b   c   d
Rome    0  1   2   3
Berlin  4  5   6   7
London  8  9  10  11

In [45]:
# show the original df
df

        A  B   C   D
rome    0  1   2   3
berlin  4  5   6   7
london  8  9  10  11

We can also use rename to insert dictionaries providing new values for indexes or columns

In [46]:
# use rename with dictionaries

df.rename(index={'london': 'Manchester'}, columns={'A': 'Alpha'})

            Alpha  B   C   D
rome            0  1   2   3
berlin          4  5   6   7
Manchester      8  9  10  11

In [47]:
# show the original df
df

        A  B   C   D
rome    0  1   2   3
berlin  4  5   6   7
london  8  9  10  11

If you would like to actually edit the data set in place, use **inplace=True**

In [34]:
# changes in-place
df.rename(index={'london': 'Manchester'}, inplace=True)
df

            A  B   C   D
rome        0  1   2   3
berlin      4  5   6   7
Manchester  8  9  10  11

## Exercises!